app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_classes_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "CSS 101"], ["room_number", 1]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_classes_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["id", 6]]